Documents/ВводНачальныхДанныхОтветственных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВводНачальныхДанныхОтветственных</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПривязкаОтветственный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контроль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВводНачальныхДанныхОтветственных/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработкаКомандыФормы(Команда)
	Если Команда.Имя = "Свернуть" Тогда
		Свернуть();
	ИначеЕсли Команда.Имя = "СвернутьПоДолжникам" Тогда
		СвернутьПоДолжникам();
	КонецЕсли;
КонецПроцедуры

Процедура Свернуть()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Должники.Свернуть("Должник, Сотрудник", "");
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

Процедура СвернутьПоДолжникам()
	Об = РеквизитФормыВЗначение("Объект");
	
	ТЗ = Об.Должники.Выгрузить();
	ТЗ.Колонки.Добавить("Количество");
	ТЗ.ЗаполнитьЗначения(1, "Количество");
	ТЗ.Свернуть("Должник", "Количество");
	
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Должник", СтрокаТЗ.Должник);
		НайденныеСтроки = Об.Должники.НайтиСтроки(ПараметрыОтбора);
		
		Для каждого СтрокаДолжники Из НайденныеСтроки Цикл
			СтрокаДолжники.Контроль = СтрокаТЗ.Количество;
		КонецЦикла; 
	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры
